import { Flex, Group, Modal, Text, Title } from "@mantine/core"
import { PenLine } from "lucide-react"
const ViewDocModal = ({opened,close}) => {

    return(
        <>
        <Modal
        w={'100%'}
        style={{ position: "absolute", right: 0 }}
        opened={opened}
        onClose={close}
        fullScreen
        radius={0}
        transitionProps={{ transition: 'fade', duration: 200 }}
      >
        <Title my={20} size={'xl'}  ta={'right'}>
            عنوان المقال
        </Title>
        <Text size="md" ta={'right'}>
            هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
             هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
              هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
               هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
                هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
                 هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
                  هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
                   هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
                    هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
                     هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
                      هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
                       هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
 هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
                هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
                 هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
                  هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
                   هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
                    هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
                     هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
                      هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
                       هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
                هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
                 هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
                  هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
                   هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
                    هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
                     هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
                      هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
                       هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
                هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
                 هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
                  هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
                   هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
                    هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
                     هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
                      هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
                       هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
                هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
                 هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
                  هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
                   هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
                    هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
                     هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
                      هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,

                       هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
                هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
                 هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
                  هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
                   هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
                    هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
                     هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
                      هنا سيكون نص المقال , هنا سيكون نص المقال , هنا سيكون نص المقال ,
        </Text>
        <Flex my={20} dir={'rtl'} justify={'right'} align={'center'} >
                  <Title size="sm" ta={'right'}>
                  تم النشر في DD-MM-YYYY بواسطة  :   
                </Title>
                 <Group display={'flex'} gap={5}>
                    <Title size="sm">اسم المركز</Title>
                     <PenLine size={15} />
                 </Group>

        </Flex>
      </Modal>
        </>
    )
}
export default ViewDocModal